{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"","text":"html { -moz-font-feature-settings: \"palt\"; -webkit-font-feature-settings: \"palt\"; font-feature-settings: \"palt\"; }","link":"/css/pkna.css"}],"posts":[{"title":"新人 DTM ミュージシャンの基本装備について","text":"この文章はこの話題のすべてを論じませんが、一部肝心な部分をここで明らかにする。主にはオーディオインターフェース（音響接面）とパソコンの選びかた。 OS（作業システム）についてWindows より macOS を選ぶ理由は： 安定性と再生音質はもっと良い。これは macOS が業界で一番おすすめされた理由。 維持性（メンテナンスしやすいこと）について、今の Windows は macOS より悪い。 特に macOS Catalina から、システム自体はウィルスに被害を受く可能性は少ない。 イアホンを使うだけで、編曲だけをやると、内蔵音響は十分強くて、外部オーディオインターフェースを買う必要はない。 iOS と同じで、macOS での大部のソフトウェアは「使いやすい」のためデザインされ。特に操作による画面の反応の速さ（実はソフトと開発者次第）。 システム内蔵の Darwin 環境を利用して、ターミナルから Homebrew や MacPorts や Anaconda などのオープンソース化ソフトを自由に大量利用できる。特に、もしソフト開発の経験があれば、 Python 3 で MIDI プログラミングは可能。 // これについて、Windows は最近 WSL モードを提供し始まったが、すぐに使えるものでなく、初期配置は macOS より複雑。 オーディオインターフェース についてオーディオインターフェース（和訳すれば「音響接面」）はパソコンと外部音響の間にある接面装置である。種類は「USB 2」「USB 3」「FireWire」「Thunderbolt 1 &amp; 2」「Thunderbolt 3」「PCIe カード」など。 今の時代でわざわざ「FireWire」「Thunderbolt 1 &amp; 2」「PCIe カード」その珍しい種類の音響接面を買う必要はない。 現時代の macOS は FireWire 音響接面をほぼ使えなくなった（一部の RME の音響接面は例外）。 「Thunderbolt 1 &amp; 2」の接面を使う音響接面は、現階段買えるすべての新品 mac 機種に直接使えなく、「Thunderbolt 3（USB-C）- Thunderbolt 2 アダプタ」が必要（そしてこのアダプタは結構高くて、お得は見えない）。 「PCIe カード」は、おそらく2010-2012と2019型番の Mac Pro 以外の mac 機種に直接使えなく、別購入の「Thunderbolt 3 PCIe カード専用ケース」（eGPU としてよく使われているやつ）が必要、そしてそのケース自体は値段は高い。 残ったのは「USB 2」「USB 3」「Thunderbolt 3」。 私は新兵におすすめしたいのは、３万円以内の「USB 3」の音響接面。なぜなら、「USB 2」の音響接面より、「USB 3」のほうが mac パソコンともっと相性良いこと。 USB 2 は今の Apple に軽視されているかもしれん……macOS の内蔵電源管理との関係は結構良くない。 私は ZOOM UAC-2 を使用中（もし今後自分のスタジオがあれば、ZOOM UAC-8 を買うかも）。他の同じほど安い優良選択があるかも。 イアホンとスピーカー について私のオススメのイアホンは SONY MDR-7506。イアパッドの物理構造は MDR-CD900ST と異なって、故に聴き応えは実に違う（「同じだ！」という業界先輩はたくさんいるけどね）。私の体験によって、SONY MDR-CD900ST で同じ音源を聞くと、音の遠近感はあんまり感じられない。もし既に SONY MDR-CD900ST を持っているのなら、ボーカル録音のときに歌手専用のイアホンとしていいんじゃない？ Genelec 8010A というスピーカーは持っていたけど、中国の実家に置かれ、日本に持ち込めなかった。たとえ持ち込んだとしても、使うと音量による近所迷惑で警察を招いてしまうから。易くないけど、聴き応えは結構良い。 それ以上もっと高いイアホン・スピーカーは新兵にとってお得よりお金の損のほうがもっと感じられるから。 mac 機種の選択専門学校や現場などでパソコンを使う新兵にとって、やはり MacBook Pro しかない。１６インチの機種は結構性能がある（重いけどね）。１３インチの機種を買いたいのなら、４つの「Thunderbolt」ポートを搭載する機種を買うこと。でなければ性能不足の恐れがある。MacBook Air は忘れよう。 デスクトップの mac 機種について、最近この５年間、業界で最も歓迎されていた機種は iMac でしたけど、今の時点で iMac を買うと賢いとは言えない。そして WWDC 2020 からの新型 iMac は以前より弱い性能で、おすすめできない。一方、Mac Pro 2019 あるいは iMac Pro を買うと、値段は高すぎ、そして性能過剰。確かに 2013 年末型番の Mac Pro（いわゆる「骨壷」）の中古品を買った人もいるけど、デザインとして不良品：4K モニターと一緒に使うと、結構固まってくるから、そして性能は 2018 型番の mac mini（６つコア）より不足。 信じられないよね？DTM 新兵としての理想なデスクトップ Mac 機種は正に 2018 型番の mac mini。20万円以内の値段で教育価格で新品の mac mini を買う事ができる（SSD は 2TB、読み込むと書き込むのスピードは iMac の Fusion Drive の何十倍より速い、そして安定性も持つ）。ただし、メモリは Apple 公式サイトで追加購入しなくてもいい、後でアップグレードできるから：Apple 以外の店で mac mini 2018 と互換性ある DDR4 SODIMM 2666MHz メモリーを買うともっと安い。私のオススメは Corsair の Vengeance メモリー、そして 32GB は私にとって足りるから。 結局 DTM 新兵にとってどのぐらいサイズのメモリー（RAM）は必要かしら？歌もの・シンセだけを作るのなら、16GB は足りるかもしれませんが、将来の可能性のため、32GB にしましょう。特に、音楽作り以外の場合、今の時代のウェブブラウザーは結構メモリー使うから。映像音楽 DTM について、使う音源次第（特に Berlin、Spitfire BBC、EastWest Hollywood Platinum などの大型のサンプル管弦音源を百トラック以上に使う場合）、64GB メモリーが必要かもしれん。 mac mini 2018 の内蔵グラフィックスは Intel UHD Graphics 630 だけですが、32GB メモリー を搭載する場合、macOS Catalina で 4K モニターと一緒に使って、グラフィクスの画像遅れなどの不具合はあんまり感じられません。万が一感じられたとしたら、eGPU は別購入して利用できます。eGPU は不必要だと私の個人認識ですが、Final Cut Pro を使いたいのなら eGPU を買ったほうがいい。 マウスの選択私のオススメは Microsoft Pro Intellimouse（NGX-00018）。今の日本での値段はゲーミング専用マウスの精密度があって、例え手は長距離で動かなくても、繊細な操作は結構できます。そして外観は地味で、普通の業務専用マウスと結構似ているので、人目を惹きにくい。特に、Microsoft Pro Intellimouse は「操作の快適感」を持つため、十数年前から結構有名です。しかし：直接買わないで、値引き情報を十分調べてから買うこと。 終わり暫く上記の情報まとめだけをここまで書きましょう。 $ EOF.","link":"/2020/06/14/20200614-DTM-equip-buying-guide-for-newcomers/"},{"title":"Catalina と不具合の Mojave 用 kext を使えるようにしてみる","text":"macOS Mojave のため構築された一部の Kext ドライバー（カーネル機能拡張ドライバー）は古い KPI で構築され、macOS Catalina とそれ以降の macOS と互換性の問題が生じてしまう：Kext を（kextload 経由）システムに再登録不能。特に「移行アシスタント」で macOS をバックアップから回復・あるいは新しい mac パソコンに移行するたびに、Kext の再登録が必要とされ、故に上記の互換性問題が生じてしまうことになる。 臨時対応方法支障のある Kext がそれぞれの開発元に（Catalina 向けの）更新を行われるまで、根本的な解決策は有りませんが、パソコンずつ設定して使えることができます。 【ステップ１】Kext のそれぞれのチーム ID をメモしておく『Mac のシステム情報について』により： システム情報を直接開くには、「option」キーを押しながら Apple メニュー  &gt;「システム情報」の順に選択します。 あるいは Spotlight で System Information.app を実行。 その後、「システム情報」のウィンドウに「ソフトウェア」→「機能拡張」の画面を見て、作動不能な Kext の情報を見て、下記のような項目に注目して、「チーム ID」をメモしておくこと： Developer ID Application: 開発元の名前 (チーム ID), Developer ID Certification Authority, Apple Root CA そして、「システム情報」のウィンドウに「ソフトウェア」→「使用停止されたソフトウェア」の画面を見て、ここでのあらゆるすべての項目のタイトルの冒頭には「チーム ID」が記されているから、メモしておくこと。 （ここまでのメモに重複された「チーム ID」は後で一回だけ使って十分。） 【ステップ２】macOS 復元モードでパソコンを再起動『macOS 復元について』によって、ステップ４まで行ってください。とりあえず、ユーティリティウインドウが表示されたまで。 その後、メニューバーの「ユーティリティ」メニューで、ターミナルを起動して、下記のコマンドを実行すること。 1spctl kext-consent add 「チーム ID」 例えば Matt Ingalls 氏に署名とアップル公証された Soundflower の Kext を使いたい場合、下記のターミナル指令を実行すると、このチーム ID に関する全ての Kext は使えるようになります（Apple に個別ブロックされた Kext は例外）： 1spctl kext-consent add 3G47DU9NXM 複数の「チーム ID」をメモした場合、一つずつを使って上記のターミナル指令を個別実行してください。 全部実行完了したあと、普通のようにパソコンを再起動すること。 【ステップ３】Kext を分別登録普通のように macOS にログインしたあとの話。 【注意】上記の手順を実行しなければ、利用者（ユーザー）側だけでブロックされた Kext を使うのはほぼ不可能です。上記の手順を実行完了すると、すぐ使えることでなく、「利用者（ユーザー）側でだけでブロックされた Kext を使うことができる」ことです。面倒くさいと思えば、別の方法もあります：『Mac で NVRAM または PRAM をリセットする』に記された手順で NVRAM をリセットして済むことです。 既にシステムにインストールされた Kext ファイルは下記のターミナル指令で使えるようになるはず（例えば Soundflower）： 1sudo kextload /Library/Extension/Soundflower.kext あるいは Kext を再インストールしてみること。そのときに、『Macの「セキュリティとプライバシー」の「一般」環境設定を変更する』に記された「ブロックされたシステムソフトウェア」の部分の説明によって、Kext を個別「使えるように設定する」ことです。 参考した資料『macOS High Sierra のカーネル機能拡張の変更点について準備を進める』の「MDM を使わない場合の User Approved Kernel Extension Loading」その部分。 $ EOF.","link":"/2020/06/14/20200614-macOS-Kext-Gatekeeper-Whitelist/"}],"tags":[{"name":"DTM, mac, オーディオインターフェース","slug":"DTM-mac-オーディオインターフェース","link":"/tags/DTM-mac-%E3%82%AA%E3%83%BC%E3%83%87%E3%82%A3%E3%82%AA%E3%82%A4%E3%83%B3%E3%82%BF%E3%83%BC%E3%83%95%E3%82%A7%E3%83%BC%E3%82%B9/"},{"name":"macOS","slug":"macOS","link":"/tags/macOS/"}],"categories":[]}